export const LAKE_CENTER = {
  lat: 23.050278,
  lng: 120.146667,
};

// 五個固定監測點，先模擬無人船跑完五點後一次更新熱圖
export const MONITOR_POINTS = [
  { point_id: "P1", name: "西北側", lat: 23.05072, lng: 120.14585 },
  { point_id: "P2", name: "東北側", lat: 23.05042, lng: 120.14655 },
  { point_id: "P3", name: "中心", lat: 23.05018, lng: 120.14675 },
  { point_id: "P4", name: "東南側", lat: 23.04982, lng: 120.14708 },
  { point_id: "P5", name: "西南側", lat: 23.04962, lng: 120.14692 },
];

// 由你提供的 GeoJSON 轉換而來
// GeoJSON 是 [lng, lat]，Leaflet Polygon 要用 [lat, lng]
export const LAKE_POLYGON = [
  [23.050880287673706, 120.14612878365062],
  [23.050886775456675, 120.14587495732263],
  [23.05075053194234, 120.14565638465075],
  [23.05057536150734, 120.14560702953082],
  [23.049478919163917, 120.14708063238413],
  [23.049673554551347, 120.14727100213184],
  [23.04981628698991, 120.14727805286208],
  [23.049881165321324, 120.14708768311607],
  [23.04999145841242, 120.14712998750406],
  [23.050186093058997, 120.1469819221461],
  [23.05034180057305, 120.1468409075182],
  [23.050458581091192, 120.14671399435423],
  [23.050529946913343, 120.14662938557814],
  [23.050620776086745, 120.14655182753239],
  [23.050880287673706, 120.14612878365062],
];

export function generateSensorData(point) {
  const co2 = 520 + Math.random() * 80;
  const ch4 = 1.98 + Math.random() * 0.04;

  return {
    ...point,
    co2: Number(co2.toFixed(2)),
    ch4: Number(ch4.toFixed(4)),
    timestamp: new Date().toLocaleString("zh-TW", {
      hour12: false,
    }),
  };
}